good_project/app/controllers/artworks_controller.rb

  def index
    render json: Artwork.all
---
SELECT "artworks".* FROM "artworks"

  def show
    @artwork = Artwork.find(params[:id])
---
SELECT "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]