good_project/app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Yeeun"], ["email", "randomemail.gmail.com"], ["created_at", "2022-12-15 14:35:55.300643"], ["updated_at", "2022-12-15 14:35:55.300643"]]
---
  def create
    @user = User.new(user_params)

    if @user.save

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
UPDATE "users" SET "email" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["email", "newemail@gmail.com"], ["updated_at", "2022-12-15 14:39:22.384866"], ["id", 6]]
---
  def update
    @user = User.find(params[:id])

    if @user
      @user.update(params.require(:user).permit(:email))

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 3]]
---
  def destroy
    @user = User.find(params[:id])

    if @user
      @user.destroy